app/views/slides/index.html.erb

SELECT "slides".* FROM "slides"
SELECT COUNT(*) FROM "slides"
---

  <% if Slide.count > 0 %>