app/controllers/attachment_controller.rb

  def show
  	@attachment = Attachment.find(params[:id])
---
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]