app/controllers/equipment_controller.rb

SELECT "equipment".* FROM "equipment"
---
  def index
    @title = "Équipements"
    @equipment = Equipment.all

INSERT INTO "attachments" ("filename", "content_type", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["filename", "equipement2.jpeg"], ["content_type", "image/jpeg"], ["data", "<19479 bytes of binary data>"], ["created_at", 2016-06-09 14:33:49 UTC], ["updated_at", 2016-06-09 14:33:49 UTC]]
INSERT INTO "equipment" ("id_attachment", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id_attachment", 13], ["description", "Superbe équipement"], ["created_at", 2016-06-09 14:33:49 UTC], ["updated_at", 2016-06-09 14:33:49 UTC]]
---
  def create
    admin_only
    return if params[:attachment].blank?

    @attachment = Attachment.new
    @attachment.uploaded_file = params[:attachment]

    @equipment = Equipment.new
    @equipment.description = params[:description]

    #respond_to do |format|
      if @attachment.save
        @equipment.id_attachment = @attachment.id
        if @equipment.save

DELETE FROM "attachments" WHERE "attachments"."id" = ?  [["id", 15]]
DELETE FROM "equipment" WHERE "equipment"."id" = ?  [["id", 3]]
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def destroy
    admin_only
    Attachment.find(@equipment.id_attachment).destroy

SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_equipment
      @equipment = Equipment.find(params[:id])