app/controllers/equip_people_controller.rb

INSERT INTO "attachments" ("filename", "content_type", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["filename", "croix.jpeg"], ["content_type", "image/jpeg"], ["data", "<11804 bytes of binary data>"], ["created_at", 2016-05-04 02:23:54 UTC], ["updated_at", 2016-05-04 02:23:54 UTC]]
---
  def create
    admin_only
    return if params[:attachment].blank?

    @attachment = Attachment.new
    @attachment.uploaded_file = params[:attachment]

    @equip_person = EquipPerson.new
    @equip_person.name = params[:name]
    @equip_person.description = params[:description]

    respond_to do |format|
      if @attachment.save

DELETE FROM "attachments" WHERE "attachments"."id" = ?  [["id", 3]]
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    Attachment.find(@equip_person.id_attachment).destroy