app/controllers/information_controller.rb

SELECT  "information".* FROM "information" WHERE "information"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "information" SET "content" = ?, "updated_at" = ? WHERE "information"."id" = ?  [["content", "Ceci est la charte de qualité !"], ["updated_at", 2016-05-03 20:05:40 UTC], ["id", 2]]
---
  def update
    admin_only
  	respond_to do |format|
  		@information = Information.find(params[:id])
  		if(@information.update(information_params))

SELECT  "information".* FROM "information" WHERE "information"."name" = ? ORDER BY "information"."id" ASC LIMIT ?  [["name", "home"], ["LIMIT", 1]]
---
  	def set_information
  		@information = Information.where(name: params[:name]).first