app/controllers/promotions_controller.rb

  def index
    @title ="Promotions"
    @promotions = Promotion.all
---
SELECT "promotions".* FROM "promotions"

  def create
    admin_only
    return if params[:attachment].blank?

    @attachment = Attachment.new
    @attachment.uploaded_file = params[:attachment]

    @promotion = Promotion.new
    @promotion.description = params[:description]

    if @attachment.save
      @promotion.id_attachment = @attachment.id
      if @promotion.save
---
INSERT INTO "attachments" ("filename", "content_type", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["filename", "promotion1.jpeg"], ["content_type", "image/jpeg"], ["data", "<23393 bytes of binary data>"], ["created_at", 2016-06-09 20:33:10 UTC], ["updated_at", 2016-06-09 20:33:10 UTC]]
INSERT INTO "promotions" ("id_attachment", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id_attachment", 28], ["description", "Nouvelle promotion"], ["created_at", 2016-06-09 20:33:10 UTC], ["updated_at", 2016-06-09 20:33:10 UTC]]

  def destroy
    admin_only
    Attachment.find(@promotion.id_attachment).destroy
---
DELETE FROM "attachments" WHERE "attachments"."id" = ?  [["id", 35]]
DELETE FROM "promotions" WHERE "promotions"."id" = ?  [["id", 4]]
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]

    def set_promotion
      @promotion = Promotion.find(params[:id])
---
SELECT  "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]