app/controllers/slides_controller.rb

SELECT "slides".* FROM "slides"
---
  def index
    @title = "Visite guidée"
    @slides = Slide.all

INSERT INTO "attachments" ("filename", "content_type", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["filename", "medecin1.jpeg"], ["content_type", "image/jpeg"], ["data", "<25045 bytes of binary data>"], ["created_at", 2016-06-09 08:34:44 UTC], ["updated_at", 2016-06-09 08:34:44 UTC]]
INSERT INTO "slides" ("id_attachment", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id_attachment", 9], ["description", "Première diapositive"], ["created_at", 2016-06-09 08:34:44 UTC], ["updated_at", 2016-06-09 08:34:44 UTC]]
---
  def create
    admin_only
    return if params[:attachment].blank?

    @attachment = Attachment.new
    @attachment.uploaded_file = params[:attachment]

    @slide = Slide.new
    @slide.description = params[:description]

    if @attachment.save
      @slide.id_attachment = @attachment.id
      if @slide.save

DELETE FROM "attachments" WHERE "attachments"."id" = ?  [["id", 10]]
DELETE FROM "slides" WHERE "slides"."id" = ?  [["id", 2]]
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def destroy
    admin_only
    Attachment.find(@slide.id_attachment).destroy

SELECT  "slides".* FROM "slides" WHERE "slides"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_slide
      @slide = Slide.find(params[:id])