app/controllers/workers_controller.rb

  def index
    @title = "Professionnels de la santé"
    @workers = Worker.all
---
SELECT "workers".* FROM "workers"

  def create
    admin_only
    @worker = Worker.new(worker_params)

=begin
    respond_to do |format|
      if @worker.save
---
INSERT INTO "workers" ("name", "description", "address", "tel", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Arthur"], ["description", "Médecin génial"], ["address", "Son adresse"], ["tel", "10 rue de l'Escalier"], ["created_at", 2016-06-08 09:28:38 UTC], ["updated_at", 2016-06-08 09:28:38 UTC]]

  def destroy
    admin_only
    @worker.destroy
---
DELETE FROM "workers" WHERE "workers"."id" = ?  [["id", 2]]

    def set_worker
      @worker = Worker.find(params[:id])
---
SELECT  "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]